trade_exp/src/InformationRegisters/СобытияДокументовАльтерра/СобытияДокументовАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3e883146-7b48-4081-a003-71ee5e8f1efb">
  <name>СобытияДокументовАльтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes extendedConfigurationObject="75c3f75b-2122-4ca4-882f-2a48b8400bb0">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8dba71fd-f575-4686-9841-236c53c988bc">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d2a1c204-387f-4476-88e2-11c124366a2b">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СобытияДокументовАльтерра/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПолучитьСобытияДокумента(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СобытияДокументовАльтерра.Документ КАК Документ,
	|	СобытияДокументовАльтерра.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра КАК СобытияДокументовАльтерра
	|ГДЕ
	|	СобытияДокументовАльтерра.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ= РезультатЗапроса.Выгрузить();
	
	мСобытий= ТЗ.ВыгрузитьКолонку("Документ");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат мСобытий
КонецФункции

Функция ПолучитьПоследнееСобытие(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияДокументовАльтерраСрезПоследних.Документ КАК Документ,
	|	СобытияДокументовАльтерраСрезПоследних.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра.СрезПоследних(, Документ = &Документ) КАК СобытияДокументовАльтерраСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Событие;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Неопределено;
	
КонецФункции

Функция БылоСобытие(Документ, Событие) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобытияДокументовАльтерра.Документ КАК Документ,
	|	СобытияДокументовАльтерра.Событие КАК Событие,
	|	СобытияДокументовАльтерра.Период КАК Период
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра КАК СобытияДокументовАльтерра
	|ГДЕ
	|	СобытияДокументовАльтерра.Документ = &Документ
	|	И СобытияДокументовАльтерра.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Событие", Событие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Ложь;
	
КонецФункции

Процедура ЗаписатьСобытие(Документ, Событие, Пользователь = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата();
	Запись.Документ = Документ;
	Запись.Событие = Событие;
	Если Пользователь <> Неопределено Тогда
		Запись.Пользователь = Пользователь; 
	КонецЕсли;
	
	НаборЗаписей.Записать(Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
#КонецЕсли
